{
  "companyName": "AL TAQA AL MALAWNA ELECTRICAL SWITCHGEAR LLC",
  "description": "ATA Switchgear Limited pioneers the manufacture and supply of a diverse range of electrical panels, including switchboards, low and medium voltage, motor control centers, capacitor banks, and more. With extensive experience in the switchgear industry, our team combines engineering expertise with a deep understanding of GCC standards and regulations, serving a wide client base across various industries.\n\nOur core values as a prominent electrical switchboard manufacturer in the UAE include honesty, loyalty, integrity, and responsibility. Client satisfaction is paramount, and we strive to exceed expectations while fostering staff growth and leaving a positive legacy.",
  "products": "We offer a comprehensive range of products:\n1. LV & MV switchgear panels\n2. Generator synchronizing panels\n3. Change over switches (Auto & Manual)\n4. Capacitor banks (Power factor correction)\n5. Generator control panels\n6. PLC and intelligent control panels\n7. Domestic and household panels\n8. Resistive load and dummy load banks\n9. Switchgear maintenance, modification and repair\n10. Switchgear spare part supply\n11. Containerized switchgear substations (LV & MV)\n12. Motor starter panels (VFD, Y-D, Soft-Starter)\n13. Generators (10KVA – 1600KVA)\n14. Lighting towers",
  "services": "Switchgear Control Board Manufacturing & Design\n\nOur Manufacturing Process and Procedures:\n• Receive client requirements and specifications\n• Optimize design for cost-effectiveness\n• Coordinate with clients for design approval\n• Submit quotation and finalize pricing\n• Conduct factory acceptance test (FAT) as per standards\n• Deliver products with as-built schematics and test reports\n\nOur Targeted Markets:\n• Residential: Economical power distribution panels for apartments and villas\n• Commercial: Reliable switchboards for hospitals, offices, and schools\n• Industrial: High-power solutions for various industries\n• Water and Sewage Treatment plants\n• Generator Packaging companies\n• Oil and Gas industries\n• Rental companies",
  "specialties": "Our Team:\n• 8 highly qualified switchgear manufacturing technicians\n• AutoCAD drafters\n• Two electrical supervising engineers\n• Qualified administrators and accountants\n• Two dedicated sales and customer relation executives\n• General Manager with an electrical engineering degree\n• Electrical consultant and designer\n\nOur Manufacturing Plant:\nLocated in Sharjah airport free zone (SAIF zone), our facility is strategically positioned for easy access and fast deliveries. Equipped with modern machinery and ample workspace, we prioritize both excellent relationships and high-quality products.\n\nTools and Equipment:\nOur workshop is equipped with a range of tools and test equipment to ensure the quality and safety of our products, including bus bar forming machines, wire cutting and stripping machines, insulation testers, label engraving machine, primary injection test unit up to 3200A (3 phase), secondary injection set, and more.\n\nPartners and Suppliers:\nWe partner with global companies to supply high-quality products and equipment, ensuring reliability and customer satisfaction.",
  "contactInfo": "AL TAQA AL MALAWNA ELECTRICAL SWITCHGEAR ASSEMBLY LLC\n\nAddress:\nCentral Region - Al Dhaid - Behind Wushah Street - New Industrial Area, Fenced Land No.1\n\nContact:\nLandline: +971 6 5353462\nMobile: +971 50229 6962\nWebsite: https://ataswg.com\nEmail: sales@ataswg.com / info@ataswg.com",
  "businessHours": "Business Hours:\nMonday - Friday: 8:00 AM - 6:00 PM\nSaturday: 8:00 AM - 1:00 PM\nSunday: Closed\n\nNote: Contact us for urgent matters outside business hours."
}

